---
kind: type
id: T:Autodesk.Revit.DB.CurtainSystem
source: html/49847a7a-35e9-09f3-e723-5f906a14b0e3.htm
---
# Autodesk.Revit.DB.CurtainSystem

Provides access to the CurtainSystem object in Autodesk Revit.

## Syntax (C#)
```csharp
public class CurtainSystem : CurtainSystemBase
```

## Remarks
The user can create CurtainSystem object and change the internal properties.